Taxi/test_invoice_retrieve/test_negative_transaction_amounts/expected_data.json

{
  "expected_response": {
    "billing_service": "food_payment_corp",
    "cashback": {
      "commit_version": 1,
      "operations": [],
      "rewarded": [],
      "status": "init",
      "transactions": [],
      "version": 1
    },
    "cleared": [
      {
        "items": [
          {
            "amount": "0.00",
            "item_id": "food"
          }
        ],
        "payment_type": "corp"
      }
    ],
    "commit_version": 6,
    "created": "2020-04-09T17:09:30.292000+03:00",
    "currency": "RUB",
    "debt": [],
    "held": [],
    "id": "with-negative-transactions",
    "invoice_due": "2020-04-09T17:19:30.283000+03:00",
    "is_processing_halted": false,
    "is_refundable": true,
    "operation_info": {
      "originator": "processing",
      "priority": 1,
      "version": 3
    },
    "operations": [
      {
        "created": "2020-04-09T17:09:30.327000+03:00",
        "id": "create:22222222222222222222222222222222",
        "status": "done",
        "sum_to_pay": [
          {
            "items": [
              {
                "amount": "1519.00",
                "item_id": "food",
                "product_id": "eda_61664402_ride"
              }
            ],
            "payment_type": "corp"
          }
        ]
      },
      {
        "created": "2020-04-09T17:13:26.438000+03:00",
        "id": "33333333333333333333333333333333",
        "status": "done",
        "sum_to_pay": []
      }
    ],
    "payment_types": [
      "corp"
    ],
    "service": "eats",
    "status": "cleared",
    "sum_to_pay": [
      {
        "items": [
          {
            "amount": "0",
            "item_id": "food"
          }
        ],
        "payment_type": "corp"
      }
    ],
    "transactions": [
      {
        "cleared": "2020-04-09T17:13:27.074000+03:00",
        "created": "2020-04-09T17:09:30.943000+03:00",
        "external_payment_id": "eats/order/200409-100000/1",
        "initial_sum": [
          {
            "amount": "1519.00",
            "item_id": "food"
          }
        ],
        "operation_id": "create:22222222222222222222222222222222",
        "payment_method_id": "corp:11111111111111111111111111111111:RUB",
        "payment_type": "corp",
        "refunds": [],
        "status": "clear_success",
        "sum": [
          {
            "amount": "1519.00",
            "item_id": "food"
          }
        ],
        "technical_error": false,
        "updated": "2020-04-09T17:13:27.074000+03:00"
      },
      {
        "cleared": "2020-04-09T17:13:27.089000+03:00",
        "created": "2020-04-09T17:13:26.719000+03:00",
        "external_payment_id": "eats/order/200409-100000/2",
        "initial_sum": [
          {
            "amount": "-1519.00",
            "item_id": "food"
          }
        ],
        "operation_id": "33333333333333333333333333333333",
        "payment_method_id": "corp:11111111111111111111111111111111:RUB",
        "payment_type": "corp",
        "refunds": [],
        "status": "clear_success",
        "sum": [
          {
            "amount": "-1519.00",
            "item_id": "food"
          }
        ],
        "technical_error": false,
        "updated": "2020-04-09T17:13:27.089000+03:00"
      }
    ],
    "user_ip": "127.0.0.1",
    "yandex_uid": "123456789"
  }
}
